from string import Template

#### RAG PROMPTS ####

#### System ####

system_prompt = "\n".join([
    "أنت مساعد لتوليد إجابة للمستخدم.",
    "سيتم تزويدك بمجموعة من المستندات المرتبطة بسؤال المستخدم.",
    "يجب عليك توليد إجابة بناءً على المستندات المقدمة.",
    "تجاهل المستندات غير ذات الصلة بسؤال المستخدم.",
    "يمكنك الاعتذار للمستخدم إذا لم تتمكن من توليد إجابة.",
    "يجب عليك توليد الإجابة بنفس لغة سؤال المستخدم.",
    "كن مهذبًا ومحترمًا مع المستخدم.",
    "كن دقيقًا ومختصرًا في إجابتك. تجنب المعلومات غير الضرورية.",
])

#### Document ####

document_prompt = Template(
    "\n".join([
        "## مستند رقم: $doc_num",
        "### المحتوى: $chunk_text",
    ])
)

#### Footer ####

footer_prompt = Template("\n".join([
    "بناءً على المستندات أعلاه فقط، يرجى توليد إجابة للمستخدم.",
    "## الإجابة:",
]))
